# Проверочная работа

**Задача**
Написать программу, которая из имеющегося массива строку формирует массив из строк, 
длина которых меньше или равно 3 символа.

**Решения**
Изначальный массив *array* вводим с клавиатуры. Потом создаем массив *resultArray* и присваеваем ему значение результата работы метода *GetLenSelectedArray*, в качестве аргумента передается изначальный массив *array* и число символов 3. Для проверки программа вызывает метод *Console.Writeline*, и он выводит получившийся массив через *string.Join*.

Метод *GetLenSelectedArray*
Внутри метода обявляется новый массив *resilt*, число элементов исходного массива, отвечающих требованиям по длине. Объявляется переменная *count = 0*. После этого циклом *foreach* программа обходит элементы исходящего массива *array*. Если элемент соответствует длине, то его значение записывается в элемент массива *result* с индексом *count*, индекс *count* увиличивается на 1. В результате выполнения *GetLenSelectedArray* возвращается массив из элеменотов исходного массива, отвечающим требованиям по длине.
